Documents/VisitPlan.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>VisitPlan</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>DateFrom</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DateTo</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Owner</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.User</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SR</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.User</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WeekNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Year</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Outlets</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Outlet</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Outlet</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Date</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/VisitPlan/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ 

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если НЕ ЗначениеЗаполнено(DateFrom)  Тогда
		DateFrom = BegOfWeek(ТекущаяДатаСеанса());
		DateTo   = EndOfWeek(DateFrom);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Year)  Тогда
		Year     = GetYear(CurrentDate());
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(WeekNumber)  Тогда
		WeekNumber = GetWeekOfYear(CurrentDate());
	КонецЕсли;
	
	Owner = SessionParameters.CurrentUser;
	
КонецПроцедуры


Function GetWeekOfYear(Date) Export
	
	CalendarYearStart = GetYear(Date);
	
	If WeekDay(CalendarYearStart) >= 1 And WeekDay(CalendarYearStart) <= 4 Then
		
		GostYearStart = BegOfWeek(CalendarYearStart);
		
	Else
		
		GostYearStart = BegOfWeek(Date(Year(CalendarYearStart), 01, 04));
		
	EndIf;
	
	WeekNumber = Int((Date - GostYearStart) / (60 * 60 * 24 * 7));
	
	Return WeekNumber + 1;
	
EndFunction

// В связи с тем, что мы считаем номера недель по стандарту ГОСТ ИСО 8601-2001 
// числа с 29 декабря по 3 января могут попадать либо в неделю относящуюся к 
// текущему году, либо в неделю относящуюся к предыдущему году. Данная функция
// принимает дату и возвращает год к которому относится эта дата.
Function GetYear(Date) Export
	
	CurrentYear = Date(Year(Date), 01, 01);
	
	If Date >= Date(Year(Date), 12, 29) And Date <= EndOfYear(Date) Then
		
		NextYear = Date(Year(CurrentYear) + 1, 01, 01);
		
		FourthJanuary = Date(Year(NextYear), 01, 04);
		
		If BegOfWeek(Date) < BegOfWeek(FourthJanuary) Then
			
			Return CurrentYear;
			
		Else
			
			Return NextYear;
			
		EndIf;
		
	ElsIf Date >= BegOfYear(Date) And Date <= Date(Year(Date), 01, 04) Then
		
		PrevYear = Date(Year(CurrentYear) - 1, 01, 01);
		
		If BegOfWeek(Date) < BegOfWeek(Date(Year(Date), 01, 04)) Then
			
			Return PrevYear;
			
		Else
			
			Return CurrentYear;
			
		EndIf;
		
	Else
		
		Return CurrentYear;
		
	EndIf;
	
EndFunction

Function BeginOfFirstWeek(Year) Export
	
	If GetWeekOfYear(Date(Year(Year), 01, 01)) = 1 Then
		
		Return BegOfWeek(Year);
		
	Else
		
		Return BegOfWeek(Date(Year(Year), 01, 04));
		
	EndIf;
	
EndFunction

Procedure Posting(Cancel, PostingMode)
	
	if Cancel  Then
		Return;
	EndIf;

EndProcedure
